# ReloadLatestOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReloadLatestOptions Class
Members See Also
---
Options to control behavior of pure reload latest (not part of synchronize with central).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ReloadLatestOptions : IDisposable
```

Visual Basic
---
```text
Public Class ReloadLatestOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ReloadLatestOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ReloadLatestOptions
# See Also
ReloadLatestOptions Members
Autodesk.Revit.DB Namespace